import re

strs = ['docexamplebucket1', 'blog-delivery-march-2020..','xn--aa', 'a', 'ss-s3alias', '192.168.5.4']
x = [re.search('(?!(^xn--|.+-s3alias$))(?!.*[.]{2})(?!^(\d+.)+\d+$)^[a-z0-9][a-z0-9-.]{1,61}[a-z0-9]$', y) for y in strs]
#(?!(^xn--|.+-s3alias$)) ไม่ขึ้นต้นด้วย xn-- และไม่ลงท้ายด้วย -s3alias
#(?!.*[.]{2}) ไม่มีจุดสองจุดติดกัน 
#(?!^(\d+.)+\d+$) ไม่มีรูปแบบเป็นที่อยู่ IP
#^[a-z0-9][a-z0-9-.]{1,61}[a-z0-9]$ ขึ้นต้นและลงท้ายด้วยตัวอักษรหรือตัวเลข, มีตัวอักษรพิมพ์เล็ก ตัวเลข จุดและขีดกลาง, ความยาว 3-63 

print(x)
